husarion/STM32Ethernet/src/utility/ethernetif.cpp
        /* Point to next descriptor */
        dmarxdesc = (ETH_DMADescTypeDef *)(dmarxdesc->Buffer2NextDescAddr);
        buffer = (uint8_t *)(dmarxdesc->Buffer1Addr);

        byteslefttocopy = byteslefttocopy - (ETH_RX_BUF_SIZE - bufferoffset);
        payloadoffset = payloadoffset + (ETH_RX_BUF_SIZE - bufferoffset);
        bufferoffset = 0;
      }

      /* Copy remaining data in pbuf */
      memcpy((uint8_t *)((uint8_t *)q->payload + payloadoffset), (uint8_t *)((uint8_t *)buffer + bufferoffset), byteslefttocopy);
      bufferoffset = bufferoffset + byteslefttocopy;
    }
  }

  /* Release descriptors to DMA */
  /* Point to first descriptor */
  dmarxdesc = EthHandle.RxFrameInfos.FSRxDesc;
  /* Set Own bit in Rx descriptors: gives the buffers back to DMA */
  for (i = 0; i < EthHandle.RxFrameInfos.SegCount; i++) {
    dmarxdesc->Status |= ETH_DMARXDESC_OWN;
    dmarxdesc = (ETH_DMADescTypeDef *)(dmarxdesc->Buffer2NextDescAddr);
  }

  /* Clear Segment_Count */
  EthHandle.RxFrameInfos.SegCount = 0;

  /* When Rx Buffer unavailable flag is set: clear it and resume reception */
  if ((EthHandle.Instance->DMASR & ETH_DMASR_RBUS) != (uint32_t)RESET) {
    /* Clear RBUS ETHERNET DMA flag */
    EthHandle.Instance->DMASR = ETH_DMASR_RBUS;
    /* Resume DMA reception */
    EthHandle.Instance->DMARPDR = 0;
  }
  return p;
}

/**
  * @brief This function should be called when a packet is ready to be read
  * from the interface. It uses the function low_level_input() that
  * should handle the actual reception of bytes from the network
  * interface. Then the type of the received packet is determined and
  * the appropriate input function is called.
  *
  * @param netif the lwip network interface structure for this ethernetif
  */
void ethernetif_input(struct netif *netif)
{
  err_t err;
  struct pbuf *p;

  /* move received packet into a new pbuf */
  p = low_level_input(netif);

  /* no packet could be read, silently ignore this */
  if (p == NULL) {
    return;
  }

  /* entry point to the LwIP stack */
  err = netif->input(p, netif);

  if (err != ERR_OK) {
    LWIP_DEBUGF(NETIF_DEBUG, ("ethernetif_input: IP input error\n"));
    pbuf_free(p);
    p = NULL;
  }
}

/**
  * @brief Returns the current state
  *
  * @param None
  * @return 0 not initialized else 1
  */
uint8_t ethernetif_is_init(void)
{
  return (EthHandle.State != HAL_ETH_STATE_RESET);
}

/**
  * @brief Should be called at the beginning of the program to set up the
  * network interface. It calls the function low_level_init() to do the
  * actual setup of the hardware.
  *
  * This function should be passed as a parameter to netif_add().
  *
  * @param netif the lwip network interface structure for this ethernetif
  * @return ERR_OK if the loopif is initialized
  *         ERR_MEM if private data couldn't be allocated
  *         any other err_t on error
  */
err_t ethernetif_init(struct netif *netif)
{
  LWIP_ASSERT("netif != NULL", (netif != NULL));

#if LWIP_NETIF_HOSTNAME
  /* Initialize interface hostname */
  netif->hostname = "lwip";
#endif /* LWIP_NETIF_HOSTNAME */

  netif->name[0] = IFNAME0;
  netif->name[1] = IFNAME1;
  /* We directly use etharp_output() here to save a function call.
   * You can instead declare your own function an call etharp_output()
   * from it if you have to do some checks before sending (e.g. if link
   * is available...) */
  netif->output = etharp_output;
  netif->linkoutput = low_level_output;

  /* initialize the hardware */
  low_level_init(netif);

  return ERR_OK;
}

/**
  * @brief  Returns the current time in milliseconds
  *         when LWIP_TIMERS == 1 and NO_SYS == 1
  * @param  None
  * @retval Current Time value
  */
u32_t sys_now(void)
{
  return HAL_GetTick();
}

/**
  * @brief  This function sets the netif link status.
  * @param  netif: the network interface
  * @retval None
  */
void ethernetif_set_link(struct netif *netif)
{
  uint32_t regvalue = 0;

#ifdef LAN9303
  //Add LAN9303 IRQ Handling

  uint32_t SMI_Phy_Addr, SMI_Reg_Addr;
  LAN9303_To_SMI_Address_Conv(LAN9303_PHY_ADDRESS, PHY_BSR, LOW_WORD_MASK, &SMI_Phy_Addr, &SMI_Reg_Addr);
  EthHandle.Init.PhyAddress = SMI_Phy_Addr;
  HAL_ETH_ReadPHYRegister(&EthHandle, SMI_Reg_Addr, &regvalue);
  EthHandle.Init.PhyAddress = LAN9303_PHY_ADDRESS;

#else
  /* Read PHY_MISR*/
  HAL_ETH_ReadPHYRegister(&EthHandle, PHY_ISFR, &regvalue);

  /* Check whether the link interrupt has occurred or not */
  if ((regvalue & PHY_ISFR_INT4) != (uint16_t)RESET) {
    netif_set_link_down(netif);
  }

  HAL_ETH_ReadPHYRegister(&EthHandle, PHY_BSR, &regvalue);
#endif

  if ((regvalue & PHY_LINKED_STATUS) != (uint16_t)RESET) {
#if LWIP_IGMP
    if (!(netif->flags & NETIF_FLAG_IGMP)) {
      netif->flags |= NETIF_FLAG_IGMP;
      igmp_init();
      igmp_start(netif);
    }
#endif
    netif_set_link_up(netif);
  }
}

/**
  * @brief  Link callback function, this function is called on change of link status
  *         to update low level driver configuration.
  * @param  netif: The network interface
  * @retval None
  */
void ethernetif_update_config(struct netif *netif)
{
  uint32_t regvalue = 0;
  uint32_t SMI_Phy_Addr, SMI_Reg_Addr, SMI_Reg_Ret_Val;

  if (netif_is_link_up(netif)) {
    /* Restart the auto-negotiation */
    if (EthHandle.Init.AutoNegotiation != ETH_AUTONEGOTIATION_DISABLE) {

#ifdef LAN9303
      /* Check Auto negotiation */
      LAN9303_To_SMI_Address_Conv(LAN9303_PHY_ADDRESS, PHY_BSR, LOW_WORD_MASK, &SMI_Phy_Addr, &SMI_Reg_Addr);
      EthHandle.Init.PhyAddress = SMI_Phy_Addr;
      HAL_ETH_ReadPHYRegister(&EthHandle, SMI_Reg_Addr, &SMI_Reg_Ret_Val);
      regvalue = (uint32_t)0x00 | SMI_Reg_Ret_Val;
      LAN9303_To_SMI_Address_Conv(LAN9303_PHY_ADDRESS, PHY_BSR, HIGH_WORD_MASK, &SMI_Phy_Addr, &SMI_Reg_Addr);
      EthHandle.Init.PhyAddress = SMI_Phy_Addr;
      HAL_ETH_ReadPHYRegister(&EthHandle, SMI_Reg_Addr, &SMI_Reg_Ret_Val);
      regvalue |= SMI_Reg_Ret_Val << 16;
      EthHandle.Init.PhyAddress = LAN9303_PHY_ADDRESS;
      if ((regvalue & PHY_BSR_AUTONEG_COMPLETE) != PHY_BSR_AUTONEG_COMPLETE) {
        goto error;
      }
      /* Configure the MAC with the Duplex Mode fixed by the auto-negotiation process */
      if (((regvalue & PHY_BASE_T_FULL_DUPLEX) | (regvalue & PHY_BASE_T_FULL_DUPLEX) | (regvalue & PHY_BASE_T2_FULL_DUPLEX)) != (uint32_t)RESET) {
        /* Set Ethernet duplex mode to Full-duplex following the auto-negotiation */
        EthHandle.Init.DuplexMode = ETH_MODE_FULLDUPLEX;
      } else {
        /* Set Ethernet duplex mode to Half-duplex following the auto-negotiation */
        EthHandle.Init.DuplexMode = ETH_MODE_HALFDUPLEX;
      }
      /* Configure the MAC with the speed fixed by the auto-negotiation process */
      if ((regvalue & PHY_BASE_T2_FULL_DUPLEX) | (regvalue & PHY_BASE_T2_HALF_DUPLEX) 
          | (regvalue & PHY_BASE_X_FULL_DUPLEX) | (regvalue & PHY_BASE_X_HALF_DUPLEX)) {
        /* Set Ethernet speed to 10M following the auto-negotiation */
        EthHandle.Init.Speed = ETH_SPEED_100M;
      } else {
        /* Set Ethernet speed to 100M following the auto-negotiation */
        EthHandle.Init.Speed = ETH_SPEED_10M;
      }
    } else { /* AutoNegotiation Disable */
error :
      /* Check parameters */
      assert_param(IS_ETH_SPEED(EthHandle.Init.Speed));
      assert_param(IS_ETH_DUPLEX_MODE(EthHandle.Init.DuplexMode));

      /* Set MAC Speed and Duplex Mode to PHY */
      LAN9303_To_SMI_Address_Conv(LAN9303_PHY_ADDRESS, PHY_BCR, LOW_WORD_MASK, &SMI_Phy_Addr, &SMI_Reg_Addr);
      EthHandle.Init.PhyAddress = SMI_Phy_Addr;
      HAL_ETH_WritePHYRegister(&EthHandle, SMI_Reg_Addr, ((uint16_t)(EthHandle.Init.DuplexMode >> 3) |
                                                     (uint16_t)(EthHandle.Init.Speed >> 1)));
      EthHandle.Init.PhyAddress = LAN9303_PHY_ADDRESS;
#else
      /* Check Auto negotiation */
      HAL_ETH_ReadPHYRegister(&EthHandle, PHY_SR, &regvalue);
      if ((regvalue & PHY_SR_AUTODONE) != PHY_SR_AUTODONE) {
        goto error;
      }

      /* Configure the MAC with the Duplex Mode fixed by the auto-negotiation process */
      if ((regvalue & PHY_DUPLEX_STATUS) != (uint32_t)RESET) {
        /* Set Ethernet duplex mode to Full-duplex following the auto-negotiation */
        EthHandle.Init.DuplexMode = ETH_MODE_FULLDUPLEX;
      } else {
        /* Set Ethernet duplex mode to Half-duplex following the auto-negotiation */
        EthHandle.Init.DuplexMode = ETH_MODE_HALFDUPLEX;
      }
      /* Configure the MAC with the speed fixed by the auto-negotiation process */
      if (regvalue & PHY_SPEED_STATUS) {
        /* Set Ethernet speed to 10M following the auto-negotiation */
        EthHandle.Init.Speed = ETH_SPEED_10M;
      } else {
        /* Set Ethernet speed to 100M following the auto-negotiation */
        EthHandle.Init.Speed = ETH_SPEED_100M;
      }
    } else { /* AutoNegotiation Disable */
error :
      /* Check parameters */
      assert_param(IS_ETH_SPEED(EthHandle.Init.Speed));
      assert_param(IS_ETH_DUPLEX_MODE(EthHandle.Init.DuplexMode));

      /* Set MAC Speed and Duplex Mode to PHY */
      HAL_ETH_WritePHYRegister(&EthHandle, PHY_BCR, ((uint16_t)(EthHandle.Init.DuplexMode >> 3) |
                                                     (uint16_t)(EthHandle.Init.Speed >> 1)));
#endif
    }
    
    /* ETHERNET MAC Re-Configuration */
    HAL_ETH_ConfigMAC(&EthHandle, (ETH_MACInitTypeDef *) NULL);

    /* Restart MAC interface */
    HAL_ETH_Start(&EthHandle);
  } else {
    /* Stop MAC interface */
    HAL_ETH_Stop(&EthHandle);
  }

  ethernetif_notify_conn_changed(netif);
}

/**
  * @brief  This function notify user about link status changement.
  * @param  netif: the network interface
  * @retval None
  */
__weak void ethernetif_notify_conn_changed(struct netif *netif)
{
  /* NOTE : This is function clould be implemented in user file
            when the callback is needed,
  */
  UNUSED(netif);
}

/**
  * @brief  This function set a custom MAC address. This function must be called
  *         before ethernetif_init().
  * @param  mac: mac address
  * @retval None
  */
void ethernetif_set_mac_addr(const uint8_t *mac)
{
  if (mac != NULL) {
    memcpy(macaddress, mac, 6);
  }
}

#ifdef LAN9303
void LAN9303_To_SMI_Address_Conv(uint32_t LAN9303_Phy_Addr, uint32_t LAN9303_Reg_Addr, 
                                 uint8_t Word_Order, uint32_t* SMI_Phy_Addr, uint32_t* SMI_Reg_Addr){
  	//SMI Phy Addr Conversion
	*SMI_Phy_Addr = PHY_ADDR_INIT_VAL;
	*SMI_Phy_Addr |= (LAN9303_Reg_Addr & PHY_ADDR_MASK) >> 6;
	//SMI Reg Addr Conversion
	*SMI_Reg_Addr = PHY_REG_ADDR_INIT_VAL;
	*SMI_Reg_Addr |= (LAN9303_Reg_Addr & PHY_REG_MASK) >> 1;
	//Conv SMI Addr to select proper word
	if(Word_Order == 0){
		*SMI_Reg_Addr |= PHY_REG_LO_WORD_MASK;
	}
	if(Word_Order == 1){
		*SMI_Reg_Addr |= PHY_REG_HI_WORD_MASK;
	}
  }
#endif

#if LWIP_IGMP
err_t igmp_mac_filter(struct netif *netif, const ip4_addr_t *ip4_addr, netif_mac_filter_action action)
{
  uint8_t mac[6];
  const uint8_t *p = (const uint8_t *)ip4_addr;

  mac[0] = 0x01;
  mac[1] = 0x00;
  mac[2] = 0x5E;
  mac[3] = *(p + 1) & 0x7F;
  mac[4] = *(p + 2);
  mac[5] = *(p + 3);

